#language: ru
#Предусловие для 2 сценария - Пользователь зарегистрирован в сервисе, Услуга отключена


    @SmokeTest @RegressionTest @uiWeb
    Функционал: Отключение/включение услуги после регистрации.

        Сценарий: 1. Отключение услуги.
            Кoгда oткрыта страница настройки /settings.
            Тогда на странице /settings нажать "Отключить доставку электронных писем".
            И пользователь переходит на страницу отключения услуги /personal.
            И Отключить доставку электронных писем.

        Сценарий: 2. Клик по логотипу.
            Когда открыта страница https://erl-individual-web.test.russianpost.ru/inbox/personal и услуга отключена.
            Тогда перейти в архив /archive/personal.
            И выполнить клик пологотипу, осуществляется переход в раздел Входящие (на страницу /inbox/personal)

        Сценарий: 3. Включение услуги.
            Когда открыта страница https://erl-individual-web.test.russianpost.ru/inbox/personal и услуга отключена.
            И сверху страницы отображается текст "4 ноября 2016 вы отключили доставку электронных писем. Включить".
            И нажать "Включить", уведомление пропадает, добавляется раздел настройки.
