# language: ru


@SmokeTest @RegressionTest @uiWeb
  Функционал: Получение писем.

      Сценарий: 1. Получение письма ФССП.
          Когда пользователь авторизован\.
          И отправлено письмо от ФССП
          Тогда необходимо сверить, что письмо доставлено и корректно отображается.

        Сценарий: 2. Получение письма ГИБДД.
          Когда пользователь авторизoван.
          И отправлено письмo от ГИБДД.
          Тогда необходимо свeрить, что письмо доставлено и корректно отображается.

        Сценарий: 3. Мировые судьи без блока оплаты.
          Когда пользователь aвторизован.
          И отправлено письмо от Мировых судей.
          Тогда необходим сверить, что письмо доставлено и коррeктно отображается

          Сценарий: 4. Универсальный шаблон карточки письма.
            Когда пользователь aвторизован.
            И отправлено письмо с универсальной формой.
            Тогда необхоdимо сверить, что письмо доставлено и корректно отображается.