# language: ru
# Предусловие для 1 сценария.
#Пользователь ранее включал онлайн-услугу

@SmokeTest @RegressionTest @uiWeb
Функционал: Настройка после регистрации

    Сценарий: 1. Авторизация с помощью ссылки "Войти через Госуслуги".
            Когда открыта страница Электронные заказные письма (лендинг)
            Тогда в хедере пройти по ссылке "Войти" (/api/v1/oauth?success_url=/setup)
            И авторизоваться под пользователем.

    Сценарий: 2. Выбрать настройки пользователя.
            Когда пользователь авторизован.
            Тогда yажать ФИО в правом верхнем углу
            И в меню выбрать "Настройки", откроется страница настроек settings.

    Сценарий: 3. Клик по логотипу.
            Когда пользователь находится на странице настроeк settings
            Тогда нажать на логотип Почты России в хедере страницы.
            И осуществляется переход пользователя в раздел Входящие.

    Сценарий: 4 Окно окно WebIM.
            Когда пользователь находится на странице настроек settings.
            Тогда внизу страницу нажать ссылку "напишите в чат".
            И откроется окно WebIM.

    Сценарий: 5. Выход из ЛК.
            Когда пользователь находится на странице настроек settings.
            Тогда нажать ФИО в правом верхнем углу
            И в меню выбрать "Выйти"
