#language: ru

    @SmokeTest @RegressionTest @uiMobile
    Функционал: Карточка письма.

        Сценарий: 1. Добавить в архив.
            Когда пользователь авторизован и находится в /inbox/personal.
            Тогда в карточке письма нажать "Убрать в архив".
            И перейти в Архив.

        Сценарий: 2. Вернуть из архива.
            Когда пoльзователь авторизован и находится в /inbox/personal.
            Тогда открыть Архив  /archive/personal.
            И в карточке письма нажать на ссылку "Вернуть из архива".
            И перейти во Входящие.

